#+title:      CE362
#+date:       [2025-02-03 seg 18:24]
#+filetags:   :lecture:
#+identifier: 20250203T182403
#+subtitle: Microeconomics
#+BIBLIOGRAPHY: ~/Org/zotero_refs.bib
#+OPTIONS: num:nil ^:{} toc:nil
#+PROPERTY:header-args gnuplot :results output drawer :eval never-export

***** Lucro máximo

#+BEGIN_latex
\begin{equation}
\pi^{\star} = p^{\star}\cdot q^{\star} - .5\cdot q^{\star2}
\end{equation}
#+END_latex
Substituindo
#+BEGIN_SRC python
pi = (60 * 20) - .5*(20)**2
print(pi)
#+END_SRC

#+RESULTS:
: 1000.0

***** Ônus do monopólio

O ônus do monopólio é a área entre o preço de máximo lucro e o preço em concorrência perfeita.

#+BEGIN_latex
\begin{equation}
\int_{q^{m}}^{q^{c}} (100 - 2q) - .5q
\end{equation}
#+END_latex

O preço em concorrência perfeita é dado por:
#+BEGIN_latex
\begin{equation}
p = CMg \Rightarrow 100 - 2q = q \Rightarrow p^{c} = \frac{100}{3}
\end{equation}
#+END_latex

#+BEGIN_latex
\begin{equation}
\int_{20}^{\frac{100}{3}} (100 - 2q) - q \Rightarrow \int_{q^{m}}^{q^{c}} 100 - 3q
\end{equation}
#+END_latex

#+BEGIN_latex
\begin{equation}
\int_{q^{m}}^{q^{c}} 100q - \frac{3}{2}\cdot q^{2}
\end{equation}
#+END_latex

#+BEGIN_latex
\begin{equation}
(100\cdot \frac{100}{3} - 100\cdot 20) - \frac{3}{2}\left(\left(\frac{100}{3})^{2}\right) - \left(20^{2}\right)
\end{equation}
#+END_latex

#+BEGIN_SRC python
onus = (100*(100/3) - 100*20) - (3/2)*((100/3)**2 - 20**2)
print(onus)
#+END_SRC

#+RESULTS:
: 266.6666666666665

